# ── Usage ────────────────────────────────────────────────────────────────────
#
#   brew bundle --file=/path/to/Brewfile   # run from anywhere
#   brew bundle                             # run from this directory
#   brew bundle --cleanup                  # also remove anything not listed here
#

# ── CLI tools ────────────────────────────────────────────────────────────────
brew "mas"        # Mac App Store CLI
brew "git"
brew "gh"         # GitHub CLI
brew "direnv"     # Per-directory environment variables
brew "fnm"        # Fast Node.js version manager
brew "pnpm"
brew "ripgrep"    # Fast grep (used by VS Code search)
brew "bat"        # Better cat with syntax highlighting
brew "eza"        # Better ls
brew "fzf"        # Fuzzy finder

# ── Apps ─────────────────────────────────────────────────────────────────────
cask "adguard"
cask "alfred"
cask "appcleaner"
cask "betterzip"
cask "calendar-366"
cask "dash"
cask "docker"
cask "finicky"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "microsoft-teams"
cask "mole"
cask "nordvpn"
cask "numi"
cask "obsidian"
cask "parallels"
cask "rapidapi"
cask "rectangle-pro"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

# ── VS Code extensions ────────────────────────────────────────────────────────
vscode "codezombiech.gitignore"

# ── Mac App Store ─────────────────────────────────────────────────────────────
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
