tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"

brew "mas"
brew "coreutils"
brew "gnu-sed"
brew "direnv"
brew "git"
#brew "jq"
#brew "tldr"
#brew "awscli"
brew "fnm"
brew "pnpm"

cask "1password"
cask "1password-cli"
cask "tresorit"
cask "alfred"
cask "adguard"
cask "appcleaner"
cask "betterzip"
cask "dash5"
cask "google-chrome"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "iterm2"
cask "calendar-366"
cask "whatsapp"
cask "finicky"
cask "rapidapi"
cask "zoom"
cask "obsidian"
cask "vlc"
cask "nordvpn"
cask "firefox"
cask "microsoft-teams"
cask "parallels"

# Quicklook plugins
#cask "qlmarkdown" # Preview Markdown files

#cask "qlcolorcode"
#cask "qlimagesize"
#cask "qlcommonmark"
#cask "qlstephen"
#cask "qlvideo"
#cask "quicklook-json"

#mas "Moom", id: 419330170
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
