tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"

brew "mas"
brew "coreutils"
brew "gnu-sed"
brew "yarn"
brew "direnv"
brew "git"
brew "jq"
brew "tldr"
brew "awscli"

cask "1password"
cask "alfred"
cask "adguard"
cask "appcleaner"
cask "betterzip"
cask "docker"
cask "dash5"
cask "google-chrome"
cask "slack"
cask "suspicious-package"
cask "tableplus"
cask "tresorit"
cask "visual-studio-code"
cask "iterm2"
cask "signal"
cask "calendar-366"
cask "whatsapp"
cask "finicky"
cask "paw"
cask "zoom"
cask "notion"
cask "vlc"

cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"

mas "Moom", id: 419330170
mas "Canary Mail App", id: 1236045954
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
